Repository: Project60/org.project60.sepapp
Catalog: l10n/*/LC_MESSAGES/sepapp.po
Languages: de_de

source: Couldn't create SEPA mandate. Error was:
de_de: SEPA Mandat konnte nicht erstellt werden:

source: Account Holder
de_de: Kontoinhaber

source: This is not a correct IBAN.
de_de: Das ist keine zulässige IBAN.

source: This is not a correct BIC.
de_de: Das ist keine zulässige BIC.

source: Bank Name
de_de: Name der Bank

source: Collection Day
de_de: Einzugstag

source: Start Date
de_de: Einzugsbeginn

source: Payment processor for the 'Single European Payment Area' (SEPA).
de_de: Zahlungsprozessor für SEPA Einzüge.

source: SEPA Direct Debit (NEW)
de_de: SEPA Direct Debit (NEU)

source: Refactored Payment processor for the 'Single European Payement Area' (SEPA).
de_de: Überarbeiteter Zahlungsprozessor für SEPA Einzüge.

source: Your CiviSEPA payment processors have been disabled.
de_de: Ihre CiviSEPA Zahlungsprozessoren wurde deaktiviert!

source: %1 Payment Processor(s) Disabled!
de_de: %1 Zahlungsprozessor(en) wurden deaktiviert!

source: Select the creditor, that should be used for this payment processor.
de_de: Wählen sie den SEPA Kreditor, der für diesen Zahlungsprozessor verwendet werden soll.

source: The creditor object not only determines the creditor ID, but also the account and the SEPA file format to be used.
de_de: Der SEPA Kreditor bestimmt nicht nur die Kreidtor-ID, sondern auch das Konto auf das eingezogen wird, sowie das zum Einzug verwendete Dateiformat.

source: Creditor
de_de: Kreditor

source: Help
de_de: Hilfe

source: Bank unknown, please enter BIC.
de_de: Unbekannte Bank, bitte BIC angeben.
